# GridBankRowHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridBankRowHeight Property
ParameterTypeId Class See Also
---
"Row Distance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridBankRowHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridBankRowHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridBankRowHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace